[
    {
        "answer-0": "We are the only agency that looks at ALL the big levers of your customer acquisition strategy, from before the click to after the click.  This holistic framework (CaAMP™) allows us to apply our proven process to diagnose, prescribe, implement and iterate solutions laid out in our comprehensive Strategic Growth Plan that address the root causes of underperforming acquisition strategies.  With world-class subject matter experts behind Creative Lab, Traffic Harmony, and Conversion Architecture, you are getting the Mount Rushmore of customer acquisition talent to unlock your business potential."
    },
    {
        "answer-1": "We have gotten great results for businesses that are focused on lead gen,  high-volume lead gen, high-ticket info businesses, and businesses that are a blend of both ecommerce and information/leadgen."
    },
    {
        "answer-2": "The best place to start is booking a call with us to see if we could be a good fit for each other.  Next up would be to get our team to do a Strategic Growth Plan for your business which will identify the biggest levers that can unlock your business potential.  Should we then agree to work with each other,  we’d schedule an onboarding call(s) where you’d meet the team who’d be working with you to review and implement the strategic growth plan.  We require a 120 day initial period of working with each other once we start – this is because it takes time, effort and patience to implement our game-changing strategies."
    },
    {
        "answer-3": "Our fee schedule is based on the recommendations (prescriptions) made via the Strategic Growth Plan.  This can be different for every customer because it really depends on your unique business’s needs.  One important thing to note is that our fee schedule also decreases the more you scale your ad spend. No, we are not the cheapest agency on the market.  Yes, we are worth every penny that we ask for!"
    },
    {
        "answer-4": "This is a valid question that comes up again and again – and for good reason. One of the most complicated parts of advertising is having to spin up new creative on a whim. Luckily, here at Tier 11, we have a world-class copy and creative team that is here to whip up scripts, ad copy, videos, gifs, images, you name it, our creative team has it covered! And what’s even better, is we use proprietary systems to not only create, but to perpetually iterate creative and copy on your behalf. That way, you’ll never ‘run out’ of ideas or new creative."
    },
    {
        "answer-5": "With all of the new privacy updates & restrictions, issues with attribution, and limitations on tracking, this is often one of the most challenging parts of marketing. Being able to measure marketing impact is so crucial to your business’ success. Tier 11 has an entire Data Science Team dedicated to getting everything set up right the first time around. Our Data Science team closely monitors your accounts day in and day out to ensure when and if something goes wrong, we know ASAP and are able to promptly remedy the problem."
    },
    {
        "answer-6": "Here at Tier 11, we work with a wide variety of businesses, and slightly larger businesses tend to see the strongest impact and value."
    },
    {
        "answer-7": "When you choose to work with Tier 11, you’ll not only have access to world class media buyers, art directors, conversion architects, and data scientists, but you’ll also gain access to your very own Account Manager who is responsible for YOUR SUCCESS. This is your go-to person that advocates FOR YOU in our company and ensures you’re happier than ever with our outputs."
    },
    {
        "answer-8": "This is the reason we offer full funnel-building services in the form of Conversion Architecture™. Conversion Architecture™ is the service we designed to create funnels that generate cold-hard-cash for your business and expertly optimize your landing pages and sales funnels."
    },
    {
        "answer-9": "This question will vary greatly on the type of business you have, the demand for your product/service in your field, and your willingness to test out new ideas and concepts.  The clients who enjoy the most success with us are the ones that have a collaborative mindset, take ownership of things they need to, and play the long game."
    }
]